In [1]:
import pandas as pd

In [2]:
ufo = pd.read_csv('http://bit.ly/uforeports')

In [6]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [3]:
pd.isnull(ufo).head()

    City  Colors Reported  Shape Reported  State   Time
0  False             True           False  False  False
1  False             True           False  False  False
2  False             True           False  False  False
3  False             True           False  False  False
4  False             True           False  False  False

In [5]:
ufo.isnull().head()

    City  Colors Reported  Shape Reported  State   Time
0  False             True           False  False  False
1  False             True           False  False  False
2  False             True           False  False  False
3  False             True           False  False  False
4  False             True           False  False  False

##### random sampling

In [7]:
ufo.sample(n=3)

               City Colors Reported Shape Reported State              Time
12426  Delray Beach             NaN       TRIANGLE    FL  10/24/1998 23:15
9968       Glendale             NaN          LIGHT    AZ   3/12/1997 21:50
2029     San Angelo             NaN          LIGHT    TX   9/10/1970 21:30

In [9]:
ufo.sample(n=3,random_state=42)

               City Colors Reported Shape Reported State              Time
217    Norridgewock             NaN           DISK    ME   9/15/1952 14:00
12282         Ipava             NaN       TRIANGLE    IL   10/1/1998 21:15
17933     Ellinwood             NaN       FIREBALL    KS  11/13/2000 22:00

In [13]:
ufo.sample(frac=0.1, random_state=99)

,City,Colors Reported,Shape Reported,State,Time
6250,Sunnyvale,NaN,OTHER,CA,12/16/1989 0:00
8656,Corpus Christi,NaN,NaN,TX,9/13/1995 0:10
2729,Mentor,NaN,DISK,OH,8/8/1974 10:00
7348,Wilson,NaN,LIGHT,WI,6/1/1994 1:00
12637,Lowell,NaN,CIRCLE,MA,11/26/1998 10:00
...,...,...,...,...,...
12919,Mentor on the Lake,NaN,SPHERE,OH,1/16/1999 16:00
7491,Gilette,NaN,FIREBALL,WY,8/15/1994 22:00
9547,Tularosa,NaN,SPHERE,NM,8/8/1996 20:30
9464,Yakima,NaN,NaN,WA,7/1/1996 12:00
5714,San Diego,NaN,DISK,CA,8/17/1987 2:30

In [12]:
ufo.shape

(18241, 5)

##### Bonus

In [14]:
train = ufo.sample(frac=0.75, random_state=99) # sampling 75% of the data

In [15]:
test = ufo.loc[~ufo.index.isin(train.index),:] # notice ~ ; Getting the non overlapping 25% into test

In [16]:
test.shape

(4560, 5)

In [17]:
train.shape

(13681, 5)